Tekla.Structures.Drawing.Connection
The Connection class contains methods related to connections.
A connection is a drawing object derived from a model object.
It represents a drawing connection that has a reference to the
actual connection in the model database.

Tekla.Structures.Drawing.Connection.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Connection.#ctor(System.Boolean)
Create instance of Connection

Tekla.Structures.Drawing.Connection.#ctor
Create instance of Connection

Tekla.Structures.Drawing.Connection.Delete
Deletes the drawing connection from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.Connection.Modify
NOT YET IMPLEMENTED.
Returns: False.

Tekla.Structures.Drawing.Connection.Insert
NOT YET IMPLEMENTED.
Returns: False.

Tekla.Structures.Drawing.Connection.Select
Selects the drawing connection from the current drawing database.
Returns: True on success.